teledoge618/DAP_GD32F407/source/cherry_usb/port/dwc2/usb_dwc2_reg.h
/*
 * Copyright (c) 2022, sakumisu
 *
 * SPDX-License-Identifier: Apache-2.0
 */
#ifndef __USB_DWC2_REG_H__
#define __USB_DWC2_REG_H__

#include "gd32f4xx.h"
#include "stdint.h"

/**
 * @brief USB_OTG_Core_Registers
 */
typedef struct {
    __IO uint32_t GOTGCTL;            /* USB_OTG Control and Status Register 000h */
    __IO uint32_t GOTGINT;            /* USB_OTG Interrupt Register 004h */
    __IO uint32_t GAHBCFG;            /* Core AHB Configuration Register 008h */
    __IO uint32_t GUSBCFG;            /* Core USB Configuration Register 00Ch */
    __IO uint32_t GRSTCTL;            /* Core Reset Register 010h */
    __IO uint32_t GINTSTS;            /* Core Interrupt Register 014h */
    __IO uint32_t GINTMSK;            /* Core Interrupt Mask Register 018h */
    __IO uint32_t GRXSTSR;            /* Receive Sts Q Read Register 01Ch */
    __IO uint32_t GRXSTSP;            /* Receive Sts Q Read & POP Register 020h */
    __IO uint32_t GRXFSIZ;            /* Receive FIFO Size Register 024h */
    __IO uint32_t DIEPTXF0_HNPTXFSIZ; /* EP0 / Non Periodic Tx FIFO Size Register 028h */
    __IO uint32_t HNPTXSTS;           /* Non Periodic Tx FIFO/Queue Sts reg 02Ch */
    uint32_t Reserved30[2];           /* Reserved 030h */
    __IO uint32_t GCCFG;              /* General Purpose IO Register 038h */
    __IO uint32_t CID;                /* User ID Register 03Ch */
    uint32_t Reserved43[48];          /* Reserved 058h-0FFh */
    __IO uint32_t HPTXFSIZ;           /* Host Periodic Tx FIFO Size Reg 100h */
    __IO uint32_t DIEPTXF[0x0F];      /* dev Periodic Transmit FIFO */
} DWC2_GlobalTypeDef;

/**
 * @brief USB_OTG_device_Registers
 */
typedef struct {
    __IO uint32_t DCFG;       /* dev Configuration Register   800h */
    __IO uint32_t DCTL;       /* dev Control Register         804h */
    __IO uint32_t DSTS;       /* dev Status Register (RO)     808h */
    uint32_t Reserved0C;      /* Reserved                     80Ch */
    __IO uint32_t DIEPMSK;    /* dev IN Endpoint Mask         810h */
    __IO uint32_t DOEPMSK;    /* dev OUT Endpoint Mask        814h */
    __IO uint32_t DAINT;      /* dev All Endpoints Itr Reg    818h */
    __IO uint32_t DAINTMSK;   /* dev All Endpoints Itr Mask   81Ch */
    uint32_t Reserved20;      /* Reserved                     820h */
    uint32_t Reserved9;       /* Reserved                     824h */
    __IO uint32_t DVBUSDIS;   /* dev VBUS discharge Register  828h */
    __IO uint32_t DVBUSPULSE; /* dev VBUS Pulse Register      82Ch */
    __IO uint32_t DTHRCTL;    /* dev threshold                830h */
    __IO uint32_t DIEPEMPMSK; /* dev empty msk                834h */
    __IO uint32_t DEACHINT;   /* dedicated EP interrupt       838h */
    __IO uint32_t DEACHMSK;   /* dedicated EP msk             83Ch */
    uint32_t Reserved40;      /* dedicated EP mask            840h */
    __IO uint32_t DINEP1MSK;  /* dedicated EP mask            844h */
    uint32_t Reserved44[15];  /* Reserved                 844-87Ch */
    __IO uint32_t DOUTEP1MSK; /* dedicated EP msk             884h */
} DWC2_DeviceTypeDef;

/**
 * @brief USB_OTG_IN_Endpoint-Specific_Register
 */
typedef struct {
    __IO uint32_t DIEPCTL;  /* dev IN Endpoint Control Reg    900h + (ep_num * 20h) + 00h */
    uint32_t Reserved04;    /* Reserved                       900h + (ep_num * 20h) + 04h */
    __IO uint32_t DIEPINT;  /* dev IN Endpoint Itr Reg        900h + (ep_num * 20h) + 08h */
    uint32_t Reserved0C;    /* Reserved                       900h + (ep_num * 20h) + 0Ch */
    __IO uint32_t DIEPTSIZ; /* IN Endpoint Txfer Size         900h + (ep_num * 20h) + 10h */
    __IO uint32_t DIEPDMA;  /* IN Endpoint DMA Address Reg    900h + (ep_num * 20h) + 14h */
    __IO uint32_t DTXFSTS;  /* IN Endpoint Tx FIFO Status Reg 900h + (ep_num * 20h) + 18h */
    uint32_t Reserved18;    /* Reserved  900h+(ep_num*20h)+1Ch-900h + (ep_num * 20h) + 1Ch */
} DWC2_INEndpointTypeDef;

/**
 * @brief USB_OTG_OUT_Endpoint-Specific_Registers
 */
typedef struct {
    __IO uint32_t DOEPCTL;  /* dev OUT Endpoint Control Reg           B00h + (ep_num * 20h) + 00h */
    uint32_t Reserved04;    /* Reserved                               B00h + (ep_num * 20h) + 04h */
    __IO uint32_t DOEPINT;  /* dev OUT Endpoint Itr Reg               B00h + (ep_num * 20h) + 08h */
    uint32_t Reserved0C;    /* Reserved                               B00h + (ep_num * 20h) + 0Ch */
    __IO uint32_t DOEPTSIZ; /* dev OUT Endpoint Txfer Size            B00h + (ep_num * 20h) + 10h */
    __IO uint32_t DOEPDMA;  /* dev OUT Endpoint DMA Address           B00h + (ep_num * 20h) + 14h */
    uint32_t Reserved18[2]; /* Reserved B00h + (ep_num * 20h) + 18h - B00h + (ep_num * 20h) + 1Ch */
} DWC2_OUTEndpointTypeDef;

/**
 * @brief USB_OTG_Host_Mode_Register_Structures
 */
typedef struct {
    __IO uint32_t HCFG;      /* Host Configuration Register           400h */
    __IO uint32_t HFIR;      /* Host Frame Interval Register          404h */
    __IO uint32_t HFNUM;     /* Host Frame Nbr/Frame Remaining        408h */
    uint32_t Reserved40C;    /* Reserved                              40Ch */
    __IO uint32_t HPTXSTS;   /* Host Periodic Tx FIFO/ Queue Status   410h */
    __IO uint32_t HAINT;     /* Host All Channels Interrupt Register  414h */
    __IO uint32_t HAINTMSK;  /* Host All Channels Interrupt Mask      418h */
    __IO uint32_t HFLBADDR;  /* Host frame list base address register 41Ch */
    uint32_t Reserved420[8]; /* Reserved                              420h */
    __IO uint32_t HPRT;      /* Host port control and status register 440h */
} DWC2_HostTypeDef;

/**
 * @brief USB_OTG_Host_Channel_Specific_Registers
 */
typedef struct {
    __IO uint32_t HCCHAR;   /* Host Channel Characteristics Register    500h */
    __IO uint32_t HCSPLT;   /* Host Channel Split Control Register      504h */
    __IO uint32_t HCINT;    /* Host Channel Interrupt Register          508h */
    __IO uint32_t HCINTMSK; /* Host Channel Interrupt Mask Register     50Ch */
    __IO uint32_t HCTSIZ;   /* Host Channel Transfer Size Register      510h */
    __IO uint32_t HCDMA;    /* Host Channel DMA Address Register        514h */
    uint32_t Reserved0;     /* Reserved                                 518h */
    __IO uint32_t HCDMAB;   /* Host Channel DMA Address Buffer Register 51Ch */
    uint32_t Reserved[2];   /* Reserved                                      */
} DWC2_HostChannelTypeDef;

#define USB_OTG_GLOBAL_BASE 0x000UL
#define USB_OTG_DEVICE_BASE 0x800UL
#define USB_OTG_IN_ENDPOINT_BASE 0x900UL
#define USB_OTG_OUT_ENDPOINT_BASE 0xB00UL
#define USB_OTG_EP_REG_SIZE 0x20UL
#define USB_OTG_HOST_BASE 0x400UL
#define USB_OTG_HOST_PORT_BASE 0x440UL
#define USB_OTG_HOST_CHANNEL_BASE 0x500UL
#define USB_OTG_HOST_CHANNEL_SIZE 0x20UL
#define USB_OTG_PCGCCTL_BASE 0xE00UL
#define USB_OTG_FIFO_BASE 0x1000UL
#define USB_OTG_FIFO_SIZE 0x1000UL

/******************************************************************************/
/*                                                                            */
/*                                       USB_OTG                              */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for USB_OTG_GOTGCTL register  ***********/
#define USB_OTG_GOTGCTL_SRQSCS_Pos (0U)
#define USB_OTG_GOTGCTL_SRQSCS_Msk (0x1UL << USB_OTG_GOTGCTL_SRQSCS_Pos) /* 0x00000001 */
#define USB_OTG_GOTGCTL_SRQSCS USB_OTG_GOTGCTL_SRQSCS_Msk                /* Session request success */
#define USB_OTG_GOTGCTL_SRQ_Pos (1U)
#define USB_OTG_GOTGCTL_SRQ_Msk (0x1UL << USB_OTG_GOTGCTL_SRQ_Pos) /* 0x00000002 */
#define USB_OTG_GOTGCTL_SRQ USB_OTG_GOTGCTL_SRQ_Msk                /* Session request */
#define USB_OTG_GOTGCTL_VBVALOEN_Pos (2U)
#define USB_OTG_GOTGCTL_VBVALOEN_Msk (0x1UL << USB_OTG_GOTGCTL_VBVALOEN_Pos) /* 0x00000004 */
#define USB_OTG_GOTGCTL_VBVALOEN USB_OTG_GOTGCTL_VBVALOEN_Msk                /* VBUS valid override enable */
#define USB_OTG_GOTGCTL_VBVALOVAL_Pos (3U)
#define USB_OTG_GOTGCTL_VBVALOVAL_Msk (0x1UL << USB_OTG_GOTGCTL_VBVALOVAL_Pos) /* 0x00000008 */
#define USB_OTG_GOTGCTL_VBVALOVAL USB_OTG_GOTGCTL_VBVALOVAL_Msk                /* VBUS valid override value */
#define USB_OTG_GOTGCTL_AVALOEN_Pos (4U)
#define USB_OTG_GOTGCTL_AVALOEN_Msk (0x1UL << USB_OTG_GOTGCTL_AVALOEN_Pos) /* 0x00000010 */
#define USB_OTG_GOTGCTL_AVALOEN USB_OTG_GOTGCTL_AVALOEN_Msk                /* A-peripheral session valid override enable */
#define USB_OTG_GOTGCTL_AVALOVAL_Pos (5U)
#define USB_OTG_GOTGCTL_AVALOVAL_Msk (0x1UL << USB_OTG_GOTGCTL_AVALOVAL_Pos) /* 0x00000020 */
#define USB_OTG_GOTGCTL_AVALOVAL USB_OTG_GOTGCTL_AVALOVAL_Msk                /* A-peripheral session valid override value */
#define USB_OTG_GOTGCTL_BVALOEN_Pos (6U)
#define USB_OTG_GOTGCTL_BVALOEN_Msk (0x1UL << USB_OTG_GOTGCTL_BVALOEN_Pos) /* 0x00000040 */
#define USB_OTG_GOTGCTL_BVALOEN USB_OTG_GOTGCTL_BVALOEN_Msk                /* B-peripheral session valid override enable */
#define USB_OTG_GOTGCTL_BVALOVAL_Pos (7U)
#define USB_OTG_GOTGCTL_BVALOVAL_Msk (0x1UL << USB_OTG_GOTGCTL_BVALOVAL_Pos) /* 0x00000080 */
#define USB_OTG_GOTGCTL_BVALOVAL USB_OTG_GOTGCTL_BVALOVAL_Msk                /* B-peripheral session valid override value  */
#define USB_OTG_GOTGCTL_HNGSCS_Pos (8U)
#define USB_OTG_GOTGCTL_HNGSCS_Msk (0x1UL << USB_OTG_GOTGCTL_HNGSCS_Pos) /* 0x00000100 */
#define USB_OTG_GOTGCTL_HNGSCS USB_OTG_GOTGCTL_HNGSCS_Msk                /* Host set HNP enable */
#define USB_OTG_GOTGCTL_HNPRQ_Pos (9U)
#define USB_OTG_GOTGCTL_HNPRQ_Msk (0x1UL << USB_OTG_GOTGCTL_HNPRQ_Pos) /* 0x00000200 */
#define USB_OTG_GOTGCTL_HNPRQ USB_OTG_GOTGCTL_HNPRQ_Msk                /* HNP request */
#define USB_OTG_GOTGCTL_HSHNPEN_Pos (10U)
#define USB_OTG_GOTGCTL_HSHNPEN_Msk (0x1UL << USB_OTG_GOTGCTL_HSHNPEN_Pos) /* 0x00000400 */
#define USB_OTG_GOTGCTL_HSHNPEN USB_OTG_GOTGCTL_HSHNPEN_Msk                /* Host set HNP enable */
#define USB_OTG_GOTGCTL_DHNPEN_Pos (11U)
#define USB_OTG_GOTGCTL_DHNPEN_Msk (0x1UL << USB_OTG_GOTGCTL_DHNPEN_Pos) /* 0x00000800 */
#define USB_OTG_GOTGCTL_DHNPEN USB_OTG_GOTGCTL_DHNPEN_Msk                /* Device HNP enabled */
#define USB_OTG_GOTGCTL_EHEN_Pos (12U)
#define USB_OTG_GOTGCTL_EHEN_Msk (0x1UL << USB_OTG_GOTGCTL_EHEN_Pos) /* 0x00001000 */
#define USB_OTG_GOTGCTL_EHEN USB_OTG_GOTGCTL_EHEN_Msk                /* Embedded host enable */
#define USB_OTG_GOTGCTL_CIDSTS_Pos (16U)
#define USB_OTG_GOTGCTL_CIDSTS_Msk (0x1UL << USB_OTG_GOTGCTL_CIDSTS_Pos) /* 0x00010000 */
#define USB_OTG_GOTGCTL_CIDSTS USB_OTG_GOTGCTL_CIDSTS_Msk                /* Connector ID status */
#define USB_OTG_GOTGCTL_DBCT_Pos (17U)
#define USB_OTG_GOTGCTL_DBCT_Msk (0x1UL << USB_OTG_GOTGCTL_DBCT_Pos) /* 0x00020000 */
#define USB_OTG_GOTGCTL_DBCT USB_OTG_GOTGCTL_DBCT_Msk                /* Long/short debounce time */
#define USB_OTG_GOTGCTL_ASVLD_Pos (18U)
#define USB_OTG_GOTGCTL_ASVLD_Msk (0x1UL << USB_OTG_GOTGCTL_ASVLD_Pos) /* 0x00040000 */
#define USB_OTG_GOTGCTL_ASVLD USB_OTG_GOTGCTL_ASVLD_Msk                /* A-session valid */
#define USB_OTG_GOTGCTL_BSESVLD_Pos (19U)
#define USB_OTG_GOTGCTL_BSESVLD_Msk (0x1UL << USB_OTG_GOTGCTL_BSESVLD_Pos) /* 0x00080000 */
#define USB_OTG_GOTGCTL_BSESVLD USB_OTG_GOTGCTL_BSESVLD_Msk                /* B-session valid */
#define USB_OTG_GOTGCTL_OTGVER_Pos (20U)
#define USB_OTG_GOTGCTL_OTGVER_Msk (0x1UL << USB_OTG_GOTGCTL_OTGVER_Pos) /* 0x00100000 */
#define USB_OTG_GOTGCTL_OTGVER USB_OTG_GOTGCTL_OTGVER_Msk                /* OTG version  */

